int/auto/OWSWSMigration/resources/dataBank/TeamEnv/Req/ReInstateReservation_TC001.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:res="http://webservices.micros.com/ows/5.1/Reservation.wsdl" xmlns:res1="http://webservices.micros.com/og/4.3/Reservation/">
   <soapenv:Header>
      <OGHeader primaryLangID="E" timeStamp="KEYWORD_GMT_TIMESTAMP" transactionID="1100" xmlns="http://webservices.micros.com/og/4.3/Core/">
         <Origin entityID="O2G" systemType="WEB"/>
         <Destination entityID="TI" systemType="ORS"/>
         <Authentication>
            <UserCredentials>
               <UserName>SUPERVISOR</UserName>
               <UserPassword>SCRUMBIZ10</UserPassword>
               <Domain>NIRMAL</Domain>
            </UserCredentials>
         </Authentication>
      </OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <res:ReInstateReservationRequest>
         <res:HotelReference chainCode="ASIA" hotelCode="NIRMAL">NIRMAL</res:HotelReference>
         <res:ConfirmationNumber type="INTERNAL" source="OPERA">Var_ConfirmationNumber</res:ConfirmationNumber>
         <res:LegNumber type="INTERNAL">1</res:LegNumber>
      </res:ReInstateReservationRequest>
   </soapenv:Body>
</soapenv:Envelope>
